      01 STRING_INFO.
	      02	ORIGINAL_STRING	PIC X(100).
	      02	BYTE_COUNT	PIC 9(4).
	      02	ASCII_SUM	PIC 9(4).
	      02    MOST_FREQUENT_CHAR PIC X(1).